package com.zhinan.zhouyi.desc.fate;

public class 格局描述器 {
    public final static String[] 优点 = {
            "严道、规则感强、风险意识强、自律周全",
            "思考多、计划强、 逻辑强、愿景大",
            "能担当、精力旺，爱付出讲义气，爱交友",
            "灵气才华、创造力、情绪敏感、共情力高",
            "务实、结果导向、目标强、经营敏感度强",
    };

    public final static String[] 局限 = {
            "顾虑多、疑心重、风险过度担忧，压力大",
            "要面子、思虑过度、行动弱、苛刻",
            "自我、固执、易冲动",
            "感性、易情绪化、思维发散、自律性差",
            "想的少、过度重视性价比、目的性强现实",
    };

    public final static String[] 交往方式 = {
            "给与安全感、权威感、放心感",
            "重视梦想和影响力、注意名在利先",
            "提出需求、价值确认、正向反馈",
            "重视主观感受、给予空间感",
            "强调实用、功利性、性价比",
    };
}
