package com.zhinan.zhouyi.desc.mingyi;

import com.alibaba.fastjson.JSONObject;
import com.zhinan.zhouyi.common.Source;
import com.zhinan.zhouyi.common.Descriptor;
import com.zhinan.zhouyi.desc.IDescriptor;
import com.zhinan.zhouyi.desc.基础描述器;
import com.zhinan.zhouyi.fate.bazi.命主;

@Descriptor(source = Source.明易)
public class 命主描述器 extends 基础描述器<命主> implements IDescriptor<命主> {
    static {
        final String[] 五常 = {
                "主仁", "主仁", "主礼", "主礼", "主信", "主信", "主義", "主義", "主智", "主智",
        };

        final String[] 指代 = {
                "自然界中代表大树之木，乔木",
                "自然界中代表花草之木，藤蔓",
                "自然界中代表太阳之火",
                "自然界中代表灯烛之火，星星之光，萤火虫之光",
                "自然界中代表城墙之土，堤坝土，气势磅礴",
                "自然界中代表田园之土，滋养万物",
                "自然界中代表大块之金，刀斧之金、铁材、刀剑，性刚质硬",
                "自然界中代表首饰之金，金银、珠宝",
                "自然界中代表江河、湖海之水",
                "自然界中代表雨露，露珠，井泉之水",
        };

        final String[] 说明 = {
                "积极向上，进取，仁慈，乐观，高度，努力，主观。宽厚阳刚，威武坚强，大方仁义，性格直爽。有领导力，掌控欲，不喜被管制，独断，心气高，有爱心。",
                "阴柔仁慈，性情温和，心地善良，八面玲珑，柔和纤细，懂得变通，善于处理纷繁复杂的工作，适应能力好，懂得顺势生长，心思细腻，回环曲折。",
                "明媚照耀，乐于助人，开朗大方，热情奔放，外刚内柔，有礼貌，重礼节，阳刚果断，恭敬谦和，威仪凛然，宽容，权威，积极，虚荣，性急，易喜怒无常。",
                "持之以恒，不服输，有坚韧不拔的精神，性情温顺，淳朴温厚，聪明有为。心思细腻，付出不求回报，和顺而有心计，敏感矛盾体，容易自我折磨，外冷内热，易叛逆，执拗，性格易飘忽不定，神秘莫测。",
                "心性中正，厚道踏实，诚信沉稳，胸怀宽大，言行一致，忠孝至诚，好敬神佛，勇敢忠义。耿直，务实，守信。固执己见，坚定朴实，保守，得时豪放勇敢，失时懦弱痴愚，倔强，不太贴心。",
                "诚信稳重，处事低调，不露锋芒，内心细腻，性格温厚，度量宽大，处事有方，不失信义，仁慈包容，善于整合团队适合做二把手，比较易被动害羞，缺乏同理心。",
                "高雅贵气，讲究精致，注重生活品质，追求完美，自尊心很强。心思很细腻，外表阳刚耿直，主张正义，做事杀伐果断，勇敢、敏锐，坚韧不拔、威严，讲义气。",
                "重情好义，爱憎分明，宁为玉碎不为瓦全，阴柔细腻，仗义疏财，英雄豪爽，助人为乐，有贵气，决断力强。外柔内刚，温润而清，灵秀讨巧，较有理财观念，是团队中的管家，第六感强。",
                "智慧聪明，交际广，人缘佳，反应灵敏，圆滑不易得罪人，适应能力超强。多智多能，宽宏大量，热情容纳，奔放自由，外柔内刚、包容，任性，不喜欢被约束。",
                "纯真细腻，至阴至柔，敏感脆弱，可塑性强，遇强则强。灵性好，文采斐然，足智多谋，聪明过人，浪漫念旧，潜力强，随机应变，善解人意，易多愁善感，不能自主，情绪容易阴郁孤僻，第六感超强，通神。",
        };

        final String[] 描述 = {
                "大树之木，仁慈，有领导力，掌控欲强，不喜欢被人管",
                "花草之木，仁爱，八面玲珑",
                "太阳之火，热情，外向，开朗，喜欢帮助别人，重礼节，讲礼貌，有仪式感",
                "炉中之火，热情，坚持，有顽强的生命力，有韧性，不达目的不罢休，有仪式感",
                "城墙之土，讲诚信，守信用",
                "田地之土，讲诚信，擅长整合团队，适合做二把手",
                "大块的金，讲义气，侠义气概，身材健硕",
                "首饰之金，灵性好，第六感强，讲义气",
                "大海之水，聪明，智慧",
                "雨露之水，聪明，第六感强，通神"
        };

        final String[] 详解 = {
                "甲木为十天干之首，为高，纵向之意，高高在上。积极，直来直往，豪爽直接，领袖气质，独立自强，善于决策追求品质。",
                "乙木弯曲横向之意，缠绕、柔情、委婉、弯曲、善良、含蓄、弹性、缠绵、坚韧不拔、柔美。最善良、注重感情。" +
                        "有一种你中有我，我中有你彼此纠缠，不分你我的情感需求。讲话比较婉转，曲径通幽。",
                "丙火心本无物故可任万物。光明磊落、猛烈、全面、冲动、大爱、付出、通透、急躁。热心大气、大将风范。丙火积极乐观，" +
                        "总是面带微笑，鼓励着大家。性情热烈，有充足爆发力和渲染力。照亮别人，乐于奉献牺牲，好面子。",
                "丁火温暖，持续，聚焦、浪漫、专注、闪烁、局部、透彻、缜密、深入、专研，疗愈付出，热情礼貌、心思细腻情感丰富。" +
                        "好奇心强，爱专研喜欢问问题。漂亮，爱打扮，喜欢思考事物的本质。",
                "戊土为厚重之土，承载力好。包容、忠诚、踏实、稳重、方厚、反应慢、中庸、木讷、承载、宽大、高山、承载。相濡以沫平淡如水。" +
                        "戊土是讲厚实包容的，很多事情是外人认真、计较，但戊土是无所谓的。性格笃实，沉稳诚实守信，说到做到。" +
                        "身如磐石如城墙一样厚重。",
                "已土为田园之土，谦卑谦逊、平薄之意。憨厚、低调、湿土、多疑、片面、保守、自卑、培育、稳健、付出。" +
                        "可塑造性强会低头，懂忍耐，会接受。承载万物默默奉献而不争。辛勤耕耘，等待大地的反馈收获，向下承载、塑造万物。",
                "庚金为干净义气、粗放之意。骨大、直接、粗犷、改革、条理、粗暴、霸道、锐利、棱角、豪爽、坚固、原则。为朋友两肋插刀是谓天地之义气。" +
                        "聚刚正之气，明辨是非，忠孝两全。果断，雷厉风行讲原则、守规矩，冷静的看待客观事物不易为情绪所波动。",
                "辛金为高贵之金，精益求精，追求完美。敏感、认真、精致、娇气、严谨、理性、周密、虚荣、专一、完美、易碎、创新。高雅贵气、心思细腻。" +
                        "爱整洁、高贵爱简约而不简单。不喜啰嗦，善于观察，自我觉察，自省力强，精致凝练。",
                "壬水有勇有谋、包罗万象。迷茫、爱哭、流动、任性、善变、随意、放荡、潇洒、包容、宽广，潇洒、无所畏惧。" +
                        "应变能力强，奔腾大气，不爱记仇，智慧聪明，亲和力强。不喜欢被约束，海浪般追求自由。",
                "癸水为雨露之水、至静至弱。神秘、安静、自怜、冷淡、无孔不入、灵活、忧郁、阴柔、灵活、弱小、润物无声。" +
                        "外表平静、内心澎湃。缺乏安全感，爱观察、敏感脆弱。富有想象力，偶尔有点神经智。雨露之水，可滋润万物静寂浪漫，温柔可人。",
        };

        final String[] 职业 = {
                "管理，人事，总务，被他人依靠的工作，喜欢一线城市工作，善于抓住机会带头干或指挥领导他人易做成行业标杆。",
                "做事全面、周到。善于捕捉大量的信息，不善于总结，纠结于选择。适合做提高市场占有率的工作适合开连锁店擅长做协调性工作，秘书、助理等。",
                "气蓬勃的太阳，照亮温暖身边人。热心、大气、顾全大局，天生就有大将风范，注重整体性团队的形象。丙火主观霸气，喜欢做拍板决策的那一个人。" +
                        "适合做饮食行业，销售口才表达的职业。",
                "一盏明灯、照亮别人。能持续的温暖别人洞察力强适合做心理疗愈师。心思细腻、多思多虑专注深研。适合做影视文化、教研、旅游、人事行政工作。",
                "戊土在中、巍然不动。保守固执、按部就班言语稳重。高山之土可以承载万物被看见需要时间的沉淀与积累。适合在地产、土相关行业默默沉淀守护。",
                "万物塑造万物滋生。己土无形，可塑造万物形态无私接纳与包容。默默奉献而不争，付出汗水可耕耘结果。易有贵人相助，适合做老师，中间人、链接的工作。",
                "条理推理、自我规划和领域。做事简单直接了当，效率高，不喜欢拖拖沓沓。有担当，讲义气，执行力惊人能成为顶梁柱精英。雷厉风行，条理清晰适合做管理者、会计、设计师，财务规划师、律师等职业。",
                "提炼重点，理解力强。工作中标准的职业女性一针见血，直戳要点。追求简单与效率，直挑重点，不啰嗦。适合做有创新的管理层的工作，想法独特，有艺术天赋。",
                "智慧宽广、思维灵动。团结性要求高，集体感强学习力强，但不持久。智囊团，应变能力强能，瞬间解决掉很多麻烦。社交非常灵活脑子快，海纳百川，适合做思想指导，策划，组织的工作。",
                "心思缜密、做事严格，情感细腻，细节专研善于体察他人。职场中易站在对方角度思考灵机应变力及处事不惊的能力。适合做科研开发、策划创作，广告传媒、采访记者，命理师等职业。",
        };

        final String[] 方向 = {
                "避免顽固死板，不服人，易操心，伤感费脑，要自我塑造，自我批评。",
                "敏感多愁、举棋不定。不要过于自我内耗，不杞人忧天，脸皮薄情感纠葛，当断不断，缠绵往事要学会放下。",
                "性急火爆，易急功近利，忽略实际操作，好大喜功。不够细心、易虎头蛇尾，做事要学会多有持续性。",
                "得势有力、失势无力。丁火需要有人陪在身边，被看见被关注。火焰飘忽不定，想的太多易生性多疑，敏感矛盾体，易自我折磨。",
                "不愿被改变易倔强固执，缺乏变通。固执天花板不喜动显得有点慵懒，要多活跃多行动起来。",
                "浅薄卑微、一吹就散。优柔寡断、内心戏多。偶尔消极趋向，忍耐力强、多思多虑，过度谨慎。易迷茫、易被人利用。",
                "不易被改变、武断固执。棱角过于分明，易伤痕累累。易冷嘲热讽遇背叛易被黑化。一根筋，过于坚持己见易极端。",
                "高冷，过于敏感，自尊心过强，不易接近，对自己要求也高，追求完美，易想太多。易有傲娇之气，偶尔虚荣心太要强。",
                "澎湃多变、随波迷茫。流动性好，稳定性差。随波逐流，也易泛滥鲁莽，偶尔冲动，易目的性和方向感差。",
                "狭小思维、易脆弱，多思多虑，没有安全感。易阴郁孤僻，缺乏胆量。偶有负能量，易过度敏感神经兮兮，要平衡心里思维等状态。",
        };

        register(Source.明易, 命主.class, "五常", 五常);
        register(Source.明易, 命主.class, "指代", 指代);
        register(Source.明易, 命主.class, "说明", 说明);
        register(Source.明易, 命主.class, "描述", 描述);
        register(Source.明易, 命主.class, "详解", 详解);
        register(Source.明易, 命主.class, "职业", 职业);
        register(Source.明易, 命主.class, "方向", 方向);
    }

    public String summary(Object o) {
        命主 zhu = (命主) o;
        return getName(zhu) + "(" + describe(zhu, "五常") + ")，" + lineSeparator
                + describe(zhu, "指代") + "，" + lineSeparator
                + describe(zhu, "说明");
    }

    @Override
    public String describe(Object o) {
        命主 zhu = (命主) o;
        return describe(zhu, "详解") + lineSeparator
                + "【适合职业】" + describe(zhu, "职业") + lineSeparator
                + "【修炼方向】" + describe(zhu, "方向");
    }

    @Override
    public JSONObject 描述(Object o) {
        return super.描述(o)
                .fluentPut("简述", summary(o))
                .fluentPut("详述", describe(o));
    }
}
