package com.zhinan.zhouyi.name;

import lombok.AllArgsConstructor;

@AllArgsConstructor
public enum 数理 {
    S1 ("太极之数", "太极之数，万物开泰，生发无穷，利禄亨通。", 吉凶.吉),
    S2 ("两仪之数", "两仪之数，混沌未开，进退保守，志望难达。", 吉凶.凶),
    S3 ("三才之数", "三才之数，天地人和，大事大业，繁荣昌隆。", 吉凶.吉),
    S4 ("四象之数", "四象之数，待于生发，万事慎重，不具营谋。", 吉凶.凶),
    S5 ("五行之数", "五行俱权，循环相生，圆通畅达，福祉无穷。", 吉凶.吉),
    S6 ("六爻之数", "六爻之数，发展变化，天赋美德，吉祥安泰。", 吉凶.吉),
    S7 ("七政之数", "七政之数，精悍严谨，天赋之力，吉星照耀。", 吉凶.吉),
    S8 ("八卦之数", "八卦之数，乾坎艮震，巽离坤兑，无穷无尽。", 吉凶.中),
    S9 ("大成之数", "大成之数，蕴涵凶险，或成或败，难以把握。", 吉凶.凶),
    S10("终结之数", "终结之数，雪暗飘零，偶或有成，回顾茫然。", 吉凶.凶),
    S11("旱苗逢雨", "万物更新，调顺发达，恢弘泽世，繁荣富贵。", 吉凶.吉),
    S12("掘井无泉", "无理之数，发展薄弱，虽生不足，难酬志向。", 吉凶.凶),
    S13("春日牡丹", "才艺多能，智谋奇略，忍柔当事，鸣奏大功。", 吉凶.吉),
    S14("破兆之数", "家庭缘薄，孤独遭难，谋事不达，悲惨不测。", 吉凶.凶),
    S15("福寿之数", "福寿圆满，富贵荣誉，涵养雅量，德高望重。", 吉凶.吉),
    S16("厚重之数", "厚重载德，安富尊荣，财官双美，功成名就。", 吉凶.吉),
    S17("刚强之数", "权威刚强，突破万难，如能容忍，必获成功。", 吉凶.中),
    S18("铁镜重磨", "权威显达，博得名利，且养柔德，功成名就。", 吉凶.中),
    S19("多难之数", "风云蔽日，辛苦重来，虽有智谋，万事挫折。", 吉凶.凶),
    S20("屋下藏金", "非业破运，灾难重重，进退维谷，万事难成。", 吉凶.凶),
    S21("明月中天", "光风霁月，万物确立，官运亨通，大搏名利。女性不宜此数。", 吉凶.吉),
    S22("秋草逢霜", "秋草逢霜，困难疾弱，虽出豪杰，人生波折。", 吉凶.凶),
    S23("壮丽之数", "旭日东升，壮丽壮观，权威旺盛，功名荣达。女性不宜此数。", 吉凶.吉),
    S24("掘藏得金", "家门余庆，金钱丰盈，白手成家，财源广进。", 吉凶.吉),
    S25("荣俊之数", "资性英敏，才能奇特，克服傲慢，尚可成功。", 吉凶.中),
    S26("变怪之数", "变怪之谜，英雄豪杰，波澜重叠，而奏大功。", 吉凶.凶),
    S27("增长之数", "欲望无止，自我强烈，多受毁谤，尚可成功。", 吉凶.凶),
    S28("阔水浮萍", "遭难之数，豪杰气概，四海漂泊，终世浮躁。女性不宜此数。", 吉凶.凶),
    S29("智谋之数", "智谋优秀，财力归集，名闻海内，成就大业。", 吉凶.吉),
    S30("非运之数", "沉浮不定，凶吉难变，若明若暗，大成大败。", 吉凶.中),
    S31("春日花开", "智勇得志，博得名利，统领众人，繁荣富贵。", 吉凶.吉),
    S32("宝马金鞍", "侥幸多望，贵人得助，财帛如裕，繁荣至上。", 吉凶.吉),
    S33("旭日升天", "旭日升天，鸾凤相会，名闻天下，隆昌至极。女性不宜此数。", 吉凶.吉),
    S34("破家之数", "破家之身，见识短小，辛苦遭逢，灾祸至极。", 吉凶.凶),
    S35("高楼望月", "温和平静，智达通畅，文昌技艺，奏功洋洋。", 吉凶.吉),
    S36("波澜重叠", "波澜重叠，沉浮万状，侠肝义胆，舍己成仁。", 吉凶.中),
    S37("猛虎出林", "权威显达，热诚忠信，宜着雅量，终身荣富。", 吉凶.吉),
    S38("磨铁成针", "意志薄弱，刻意经营，才识不凡，技艺有成。", 吉凶.中),
    S39("富贵荣华", "富贵荣华，财帛丰盈，暗藏险象，德泽四方。", 吉凶.中),
    S40("退安之数", "智谋胆力，冒险投机，沉浮不定，退保平安。", 吉凶.凶),
    S41("有德之数", "纯阳独秀，德高望重，和顺畅达，博得名利。此数最大好运数。", 吉凶.吉),
    S42("寒蝉在柳", "博识多能，精通世情，如能专心，尚可成功。", 吉凶.凶),
    S43("散财破产", "散财破产，诸事不遂，虽有智谋，财来财去。", 吉凶.凶),
    S44("烦闷之数", "破家亡身，暗藏惨淡，事不如意，乱世怪杰。", 吉凶.凶),
    S45("顺风之数", "新生泰和，顺风扬帆，智谋经纬，富贵繁荣。", 吉凶.吉),
    S46("浪里淘金", "载宝沉舟，浪里淘金，大难尝尽，大功有成。", 吉凶.凶),
    S47("点石成金", "花开之象，万事如意，祯祥吉庆，天赋幸福。", 吉凶.吉),
    S48("古松立鹤", "智谋兼备，德量荣达，威望成师，洋洋大观。", 吉凶.吉),
    S49("转变之数", "吉临则吉，凶来则凶，转凶为吉，配好三才。", 吉凶.中),
    S50("小舟入海", "一成一败，吉凶参半，先得庇荫，后遭凄惨。", 吉凶.中),
    S51("沉浮之数", "盛衰交加，波澜重叠，如能慎始，必获成功。", 吉凶.中),
    S52("达眼之数", "卓识达眼，先见之明，智谋超群，名利双收。", 吉凶.吉),
    S53("曲卷难星", "外祥内患，外祸内安，先富后贫，先贫后富。", 吉凶.凶),
    S54("石上栽花", "石上栽花，难得有活，忧闷烦来，辛惨不绝。", 吉凶.凶),
    S55("善恶之数", "善善得恶，恶恶得善，吉到极限，反生凶险。", 吉凶.中),
    S56("浪里行舟", "历尽艰辛，四周障碍，万事龃龌，做事难成。", 吉凶.凶),
    S57("日照春松", "寒雪青松，夜莺吟春，必遭一过，繁荣白事。", 吉凶.吉),
    S58("晚行遇月", "沉浮多端，先苦后甜，宽宏扬名，富贵繁荣。", 吉凶.中),
    S59("寒蝉悲风", "寒蝉悲风，意志衰退，缺乏忍耐，苦难不休。", 吉凶.凶),
    S60("无谋之数", "无谋之人，漂泊不定，晦暝暗黑，动摇不安。", 吉凶.凶),
    S61("牡丹芙蓉", "牡丹芙蓉，花开富贵，名利双收，定享天赋。", 吉凶.吉),
    S62("衰败之数", "衰败之象，内外不和，志望难达，灾祸频来。", 吉凶.凶),
    S63("舟归平海", "富贵荣华，身心安泰，雨露惠泽，万事亨通。", 吉凶.吉),
    S64("非命之数", "骨肉分离，孤独悲愁，难得心安，做事不成。", 吉凶.凶),
    S65("巨流归海", "天长地久，家运隆昌，福寿绵长，事事成就。", 吉凶.吉),
    S66("岩头步马", "进退维谷，艰难不堪，等待时机，一跃而起。", 吉凶.凶),
    S67("顺风通达", "天赋幸运，四通八达，家道繁昌，富贵东来。", 吉凶.吉),
    S68("顺风吹帆", "智虑周密，集众信达，发明能智，拓展昂进。", 吉凶.吉),
    S69("非业之数", "非业非力，精神迫滞，灾害交至，遍偿痛苦。", 吉凶.凶),
    S70("残菊逢霜", "残菊逢霜，寂寞无碍，惨淡忧愁，晚景凄凉。", 吉凶.凶),
    S71("石上金花", "石上金花，内心劳苦，贯彻始终，定可昌隆。", 吉凶.中),
    S72("劳苦之数", "荣苦相伴，阴云覆月，外表吉祥，内实凶祸。", 吉凶.中),
    S73("无勇之数", "盛衰交加，徒有高志，天王福祉，终世平安。", 吉凶.中),
    S74("残菊经霜", "残菊经霜，秋叶寂寞，无能无智，辛苦繁多。", 吉凶.凶),
    S75("退守之数", "退守保吉，发迹甚迟，虽有吉象，无谋难成。", 吉凶.凶),
    S76("离散之数", "倾覆离散，骨肉分离，内外不和，虽劳无功。", 吉凶.凶),
    S77("半吉之数", "家庭有悦，半吉半凶，能获援护，陷落不幸。", 吉凶.中),
    S78("晚苦之数", "祸福参半，先天智能，中年发达，晚景困苦。", 吉凶.凶),
    S79("云头望月", "云头望月，身疲力尽，穷迫不伸，精神不定。", 吉凶.凶),
    S80("遁吉之数", "辛苦不绝，早入隐遁，安心立命，化凶转吉。", 吉凶.凶),
    S81("万物回春", "最吉之数，还本归元，吉祥重叠，富贵尊荣。", 吉凶.吉);

    String name;
    String description;
    吉凶 jiXiong;

    public static 数理 getByScore(int score) {
        return values()[score - 1];
    }

    @Override
    public String toString() {
        return "[" + (ordinal() + 1) + (ordinal() + 1 >  9 ? " - " : "  - ") + jiXiong.name() + " - " + name + ", " + description + ']';
    }

    public static boolean isGood(int score) {
        return getByScore(score).jiXiong.isGood();
    }
}
